#Початок подорожі
puts "Вийшли ви на поріг. Невстигли ви одуматись як Ваши ноги занесли вас в темний сірий ліс.
Листя не колихається, птахи не співають.
Тільки чути як на верхів`яx дерев колихаються листя від вітру.
Ви опинились на стежинці яка веде десь далі"
puts "Що Ви оберете підете далі чи повернетесь додому
1. Піду далі
2. Повернусь додому"
choice = gets.to_i

#Вибір напрямку
if choice == 2
	abort "Ви позбавили себе пригод і емоцій на все життя"
else choice = 1
	puts "Ви зробили правельний вибір! 
	Ваші ноги почали рухатись в перед на зустріч пригодам."
end
#Початок пригод
puts "Пройшли ви другий поворт, як обрнувшись ви не бачите початку вашої стежини. 
І тут ви чуєте легкий шерех листя на землі. Піднявши очі до гори як раптом перед вами стоїть
величезний павук"
puts "Перед Вами постає вибір що роботи втікати чи вступити в бій
1. Вступити в бій
2. Втікти"
choice = gets.to_i

if choice == 2
	abort "Павук Вас наздогнав, лапою пробив Вам плече, прижавши до землі і встромив своє жало 
	вспину. Обмотав тіло павутиною, павук підвісив вас на гілці величезного дерева щоб потім Вами поласувати.
	Кінець вашої подоріжжі і життя"
else choice == 1
	puts "Ви дістали свій меч і встромили його в павука, від болю павук упав і сжався
	Діставши свій меч з тіла павука ви пішли далі"
end
puts "Заспокоївшись, перевівши дух, пішли далі, на натрапили на річку, широку та гливобу, яку в не перепливти,
 'потрібен човен - подумали ви. Як раптом ви почули дивний голос..."
puts "Якщо тобі потрібен човен то я можу тобі цим допомогти"
puts "Ви: озирнувшись, ви нікого не побачили"
puts "Голос: так тобі потрібен човен чи ні? - запитав дивний голос.
1. Так потрібен
2. Ні я сам перепливу"
choice = gets.to_i

if choice == 2
	abort "Вам невдалось перепливти річку, ви потонули. Стали закускою для річкових мешкінців."
else choice == 1
	puts "Добре, але є одна умова, тобі потрібно відповісти на мої три запитання, на кожне питання
	в тебе 3 спроби"
end

puts "Запитання перше:
Скільки днів в році?"
#Кількість попиток на кожне запитання
num_quesses = 0
#Цикл на продовження
quessed_it = false
until  num_quesses == 3 || quessed_it
	puts "У вас залишилось #{3 - num_quesses} спроби"
	puts "введить відповідь"
	day = gets.to_i
	num_quesses += 1
	if day == 365
		puts "Гарна робота"
		puts "перейдемо на наступне питання"
		quessed_it = true
	else day != 365
		puts "Нажаль Ви неправельно надали відповідь"
	end
end
unless quessed_it
	abort "Ви залишились в лісі назавжди, і померли з голоду"
end
puts "Запитання друге:
Скільки буде 6 помножити на 8?"
#Кількість попиток на кожне запитання
num_quesses = 0
#Цикл на продовження
quessed_it = false
until  num_quesses == 3 || quessed_it
	puts "У вас залишилось #{3 - num_quesses} спроби"
	puts "введить відповідь"
	quess = gets.to_i
	num_quesses += 1
	if quess == 48
		puts "Гарна робота"
		puts "перейдемо на наступне питання"
		quessed_it = true
	else quess != 48
		puts "Нажаль Ви неправельно надали відповідь"
	end
end
unless quessed_it
	abort "Ви залишились в лісі назавжди, і померли з голоду"
end
puts "Запитання третє:
Яка відповідь була на питання \"О жизни, вселенно и вообще\", в фильме Автостопом по галактике"
#Кількість попиток на кожне запитання
num_quesses = 0
#Цикл на продовження
quessed_it = false
until  num_quesses == 3 || quessed_it
	puts "У вас залишилось #{3 - num_quesses} спроби"
	puts "введить відповідь: "
	quess = gets.to_i
	num_quesses += 1
	if quess == 42
		puts "Гарна робота"
		puts "Ось тримай човен"
		quessed_it = true
	else quess != 42
		puts "Нажаль Ви неправельно надали відповідь!"
	end
end
unless quessed_it
	abort "Ви залишились в лісі назавжди, і померли з голоду!"
end
puts "Ви перепливли річку, подякували голосу за човен, і пішли.
Опинились на краю лісу з відки ви і прийшли."
puts "Гарна прогулянка лісом."