names = [] #пустий масив для наповення імен
user_input = nil #змінна з обявленям пусто, для того щоб в циклі можна було задавати к консолі значення
while user_input != '' do #початок циклу
	user_input = gets.chomp #запит на введення занчення з методом лишніх рядків
	names << user_input #Запис всіх значеннь в пустий масив для зберігання
end
for item in names do #Цикл для перебору значень в масиві 
	puts "С нами " + item
	sleep 1
	if item == 'Еліс' #Якщо введене значення буде відповідати умові буде аваріно завершено цикл
		puts "Еліс?? Кто такая Еліс?"
	break
	end
end
sleep 2
puts "Что это за девушка и где она живет?"
sleep 2
puts "А вдруг она не курить? А вдруг она не пьет?"
sleep 2
puts "А ми стакими рожами возьмем да и припрёмся к Еліс...))"