#Масив для перебору
eggs = [0, 5, 5, 0, 0, 0, 5, 0, 8, 8, 8, 0, 5, 0, 6]
#Пустий масив для перебраних значень
good_eggs = []
#Змінна для виводу кількості перебраних значень
broken_eggs = 0
#Початок циклю для перебору
for item in eggs do #item тимчасова змінна для зберігання перебраних значень, не повиння співадати з реальними
	if item != 0
		broken_eggs += 1
	else
		good_eggs << item #Запис значення змінної в масив
	end

end
puts "Всего яиц " + eggs.size.to_s
puts "Хороших яиц в лотке " + good_eggs.size.to_s
puts "Битых яиц всего " + broken_eggs.size.to_s